import React from "react";
import "./styles.css";

export const TasksTip = () => {
  return (
    <div className="tasks-tip-container">
      <div className="tasks-tip-container-up-block">
        <span className="tasks-tip-container-up-block-text">Совет:</span>
      </div>
      <div className="tasks-tip-container-down-block">
        <p className="tasks-tip-container-down-block-text">
          1. Продумайте цели своей жизни. Осмыслите ваш внешний и внутренний
          (личностные качества, накопленный опыт и знания) потенциал и найдите –
          «Что ценного, ощутимо полезного важно развить в себе в ближайшие два -
          три года». Опишите это «ценное и полезное» как можно понятнее и четче.
          Не экономьте время. Самое ценное часто появляется только к концу
          размышлений.
        </p>
        <p className="tasks-tip-container-down-block-text">
          2. Выберите из пункта 1 одну задачу. Пусть она станет первым «шагом
          саморазвития». * Лучше выбирать и четко решать одну задачу, а затем –
          вторую и так далее. Таким способом вы быстрее и эффективнее решите все
          важные задачи развития. Проверено опытом.
        </p>
        <p className="tasks-tip-container-down-block-text">
          3. Подберите «Развивающее дело».
        </p>
        <p className="tasks-tip-container-down-block-text">
          4. Определите в месяцах период работы для первого плана развития себя
          - «Шага саморазвития 1». Лучше не выходить за пределы полугодия. *
          Если задача потребует больше времени, - подведете итоги 1-го плана,
          осмыслите опыт работы и составите план на следующий период – «Шаг
          саморазвития 2».
        </p>
        <p className="tasks-tip-container-down-block-text">
          5. Определите Цели работы и конкретные результаты, которые намерены
          получить к концу выбранного периода. В этом может помочь «Форма выбора
          Дела». Даем ее ниже.
        </p>
        <p className="tasks-tip-container-down-block-text">
          6. Составьте 1-й недельный план. И – вперед!
        </p>
        <p className="tasks-tip-container-down-block-text">
          Важно. После завершения «Шага саморазвития 1» (выбранного периода
          работы) подведите итоги. Полезно выделить время и осмыслить (ясно
          понять): <br /> - что полезного удалось получить;
          <br /> - что из намеченного пока не удалось получить и почему;
          <br /> - что упускалось, забывалось в работе;
          <br /> - что важно в дальнейшем делать иначе.
        </p>
        <p className="tasks-tip-container-down-block-text"></p>
      </div>
    </div>
  );
};
